// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
/*
void Quad(int x)
{
    int current = 1;
    while (current <= x)
    {
        int quad = current * current;
        Console.Write(quad + " ");
        current++;
    }
}

Console.WriteLine("Input a number: ");
int n = Convert.ToInt32(Console.Readline());
Quad (n);
*/
